{
    "_name_or_path": "Qwen/Qwen3-4B-Thinking-2507",
    "architectures": [
        "Qwen2ForCausalLM"
    ],
    "attention_bias": true,
    "attention_dropout": 0.0,
    "bos_token_id": 151643,
    "eos_token_id": 151645,
    "hidden_act": "silu",
    "hidden_size": 2560,
    "initializer_range": 0.02,
    "intermediate_size": 9728,
    "max_position_embeddings": 40960,
    "max_window_layers": 36,
    "model_type": "qwen2",
    "num_attention_heads": 32,
    "num_hidden_layers": 36,
    "num_key_value_heads": 8,
    "rms_norm_eps": 1e-06,
    "rope_scaling": null,
    "rope_theta": 1000000.0,
    "sliding_window": null,
    "tie_word_embeddings": true,
    "torch_dtype": "bfloat16",
    "transformers_version": "4.51.0",
    "use_cache": true,
    "use_sliding_window": false,
    "vocab_size": 151936,
    "_comment": "Hidden states extraction config for vLLM plugin",
    "eagle_aux_hidden_state_layer_ids": [
        8,
        16,
        24,
        35
    ],
    "speculator": {
        "speculator_type": "extract_hidden_states"
    }
}